import React from 'react';

function UnderlineIcon({ className }) {
    return (
        <svg xmlns="http://www.w3.org/2000/svg" className={ className } viewBox="0 0 53.84 80.77" shapeRendering="crispEdges">
            <title>Подчёркнутый</title>
            <polygon points="38.46 0 38.46 7.69 42.3 7.69 42.3 42.31 38.46 42.31 38.46 50 34.61 50 34.61 53.85 30.77 53.85 30.77 57.69 23.07 57.69 23.07 53.85 19.23 53.85 19.23 50 15.38 50 15.38 42.31 11.54 42.31 11.54 7.69 15.38 7.69 15.38 0 0 0 0 7.69 3.84 7.69 3.84 42.31 7.69 42.31 7.69 50 11.54 50 11.54 57.69 15.38 57.69 15.38 61.54 23.07 61.54 23.07 65.39 30.77 65.39 30.77 61.54 38.46 61.54 38.46 65.39 53.84 65.39 53.84 57.69 50 57.69 50 7.69 53.84 7.69 53.84 0 38.46 0"/>
            <rect y="73.08" width="53.84" height="7.69"/>
        </svg>
    )
}

export default UnderlineIcon;